bench_bnb/app/controllers/api/benches_controller.rb

  def index
    @benches = Bench.all
---
SELECT "benches".* FROM "benches"